<?php

namespace Database\Seeders;

use App\Models\User;
// use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
// use Illuminate\Support\Str;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     */
    public function run(): void
    {
        // User::factory(10)->create();

        // User::factory()->create([
        //     'name' => 'Test User',
        //     'email' => 'test@example.com',
        // ]);

        DB::table('logos')->insert([
            'name' => 'আল জান্নাত ইসলামিক এডুকেশন ইনস্টিটিউট',
        ]);

        DB::table('footers')->insert([
            'title' => '&copy; Copyright 2024',
        ]);

        DB::table('school_histories')->insert([
            'title' => 'প্রতিষ্ঠানের ইতিহাস',
            'description' => 'সুনামগঞ্জ জেলাধীন জগন্নাথপুরস্থ এক প্রাচীন জনপদের নাম ইসহাকপুর । এ গ্রামের সম্ভ্রান্ত ধর্মভীরু মুসলিম পরিবার সমূহের মধ্যে শীর্ষস্থানে অবস্থান খান পরিবারের । বংশমর্যাদায় যেমন শ্রেষ্ঠত্বের দাবীদার তেমনি শিক্ষা-দীক্ষায়, ধর্মভীরুতায়.সামাজিক আচার-অনুষ্ঠানে এ জনপদের অন্য সবের উপর রয়েছে এ পরিবারের অতুলনীয় সম্মান। যতদূর জানা যায় মরহুম দেলওয়ার খান ছিলেন এ পরিবারের একজন শিক্ষিত ব্যক্তি ।তিনি যেমন ছিলেন শিক্ষানুরাগী তেমনটি ধর্মানুরাগী এবং পরহেযগার। তাঁর দুই ছেলে সন্তান বড় ছেলের নাম মুজাম্মিল খান এবং ছোট ছেলের নাম মাহমুদ খান। মুজাম্মিল খানের ৩ (তিন) ছেলে সন্তানের মধ্যে বড় ছেলের নাম আব্দুর গাফ্ফার খান মেঝো ছেলের নাম খান জয়নাল আবেদিন ছোট ছেলের নাম মোনায়েম খান। দীর্ঘদিন থেকেই পূর্বপুরুষের ইতিহাস ঐতিহ্য ধরে রাখার মনোস্কামনায় এবং সমাজ সেবার অংশ হিসেবে নিঃস¦ার্থ ভাবে খান জয়নাল আবেদিন ”খান ওয়েলফেয়ার ট্রাস্ট” নামে একটি ট্রাস্ট গঠনের প্রস্তাব খান বংশের সকল সদস্য বরাবর উপস্থাপন করলে তা অনুমোদিত হয় এবং ২০০০ সালে উক্ত” খান ওয়েল ফেয়ার ট্রাস্ট” গঠন করা হয়। গঠনতন্ত্র অনুযায়ী ট্রাস্টের অধীন মাদরাসা,মসজিদ, এতীমখানা, হাসপাতাল সহ অন্যান্য সেবাধর্মী প্রতিষ্ঠান গড়ে তোলার প্রতিশ্রুতির অংশ হিসেবে ২০০২ সালে অত্র ট্রাস্টের অধীন প্রতিষ্ঠা করা হয় আল জান্নাত ইসলামিক এডুকেশন ইনস্টিটিউট নামের এ বিশাল মাদরাসা ।',
        ]);

        // End of code
    }
}
